//
//  Localizable.strings
//  Stats
//
//  Created by eightscrow on 07/12/2024.
//  Using Swift 5.0.
//  Running on macOS 10.15.
//
//  Copyright © 2020 Serhiy Mytrovtsiy. All rights reserved.
//

// Modules
"CPU" = "CPU";
"Open CPU settings" = "Avaa CPU asetukset";
"GPU" = "Näytönohjain"; // translategemma:4b
"Open GPU settings" = "Avaa GPU asetukset";
"RAM" = "RAM";
"Open RAM settings" = "Avaa RAM asetukset";
"Disk" = "Levy";
"Open Disk settings" = "Avaa Levy asetukset";
"Sensors" = "Anturit";
"Open Sensors settings" = "Avaa Anturit asetukset";
"Network" = "Verkko";
"Open Network settings" = "Avaa Verkko asetukset";
"Battery" = "Akku";
"Open Battery settings" = "Avaa Akku asetukset";
"Bluetooth" = "Bluetooth";
"Open Bluetooth settings" = "Avaa Bluetooth asetukset";
"Clock" = "Kello";
"Open Clock settings" = "Avaa Kello asetukset";

// Words
"Unknown" = "Tuntematon";
"Version" = "Versio";
"Processor" = "Suoritin";
"Memory" = "Muisti";
"Graphics" = "Grafiikka";
"Close" = "Sulje";
"Download" = "Lataa";
"Install" = "Asenna";
"Cancel" = "Peruuta";
"Unavailable" = "Ei saatavilla";
"Yes" = "Kyllä";
"No" = "Ei";
"Automatic" = "Automaattinen";
"Manual" = "Manuaalinen";
"None" = "Ei mitään";
"Dots" = "Pisteet";
"Arrows" = "Nuolet";
"Characters" = "Merkit";
"Short" = "Lyhyt";
"Long" = "Pitkä";
"Statistics" = "Tilastot";
"Max" = "Maksimi";
"Min" = "Minimi";
"Reset" = "Palauta";
"Alignment" = "Tasaus";
"Left alignment" = "Vasen";
"Center alignment" = "Keskellä";
"Right alignment" = "Oikea";
"Dashboard" = "Kojelauta";
"Enabled" = "Käytössä";
"Disabled" = "Pois käytöstä";
"Silent" = "Hiljainen";
"Units" = "Yksiköt";
"Fans" = "Tuulettimet";
"Scaling" = "Skaalaus";
"Linear" = "Lineaarinen";
"Square" = "Neliö";
"Cube" = "Kuutio";
"Logarithmic" = "Logaritmi";
"Fixed scale" = "Kiinteä";
"Cores" = "Ytimet";
"Settings" = "Asetukset";
"Name" = "Nimi";
"Format" = "Muoto";
"Turn off" = "Sammuta";
"Normal" = "Normaali"; // translategemma:4b
"Warning" = "Varoitus";
"Critical" = "Kriittinen";
"Usage" = "Käyttö";
"2 minutes" = "2 minuuttia";
"3 minutes" = "3 minuuttia";
"10 minutes" = "10 minuuttia";
"Import" = "Tuo";
"Export" = "Vie";
"Separator" = "Erotin"; // translategemma:4b
"Read" = "Lue"; // translategemma:4b
"Write" = "Kirjoita"; // translategemma:4b
"Frequency" = "Taajuus"; // translategemma:4b
"Save" = "Tallenna"; // translategemma:4b
"Run" = "Juokse"; // translategemma:4b
"Stop" = "Pysäytä"; // translategemma:4b
"Uninstall" = "Poista asennus"; // translategemma:4b
"1 sec" = "1 sekunti"; // translategemma:4b
"2 sec" = "2 sekuntia"; // translategemma:4b
"3 sec" = "3 sekuntia"; // translategemma:4b
"5 sec" = "5 sekuntia"; // translategemma:4b
"10 sec" = "10 sekuntia"; // translategemma:4b
"15 sec" = "15 sekuntia"; // translategemma:4b
"30 sec" = "30 sekuntia"; // translategemma:4b
"60 sec" = "60 sekuntia"; // translategemma:4b

// Setup
"Stats Setup" = "Stats asennus";
"Previous" = "Edellinen";
"Previous page" = "Edellinen sivu";
"Next" = "Seuraava";
"Next page" = "Seuraava sivu";
"Finish" = "Valmis";
"Finish setup" = "Viimeistele asennus";
"Welcome to Stats" = "Tervetuloa Stats:iin";
"welcome_message" = "Kiitos, että käytät Statsia, ilmaista avoimen lähdekoodin macOS-järjestelmämonitoria valikkorivillesi.";
"Start the application automatically when starting your Mac" = "Käynnistä sovellus automaattisesti, kun käynnistät Macin";
"Do not start the application automatically when starting your Mac" = "Älä käynnistä sovellusta automaattisesti, kun käynnistät Macin";
"Do everything silently in the background (recommended)" = "Tee kaikki hiljaisesti taustalla (suositeltu)";
"Check for a new version on startup" = "Tarkista uusi versio käynnistyksen yhteydessä";
"Check for a new version every day (once a day)" = "Tarkista uusi versio päivittäin (kerran päivässä)";
"Check for a new version every week (once a week)" = "Tarkista uusi versio viikoittain (kerran viikossa)";
"Check for a new version every month (once a month)" = "Tarkista uusi versio kuukausittain (kerran kuukaudessa)";
"Never check for updates (not recommended)" = "Älä koskaan tarkista päivityksiä (ei suositeltu)";
"Anonymous telemetry for better development decisions" = "Anonyymi telemetria parempaa tuotekehitystä varten";
"Share anonymous telemetry data" = "Jaa anonyymit telemetriatiedot";
"Do not share anonymous telemetry data" = "Älä jaa anonyymejä telemetriatietoja";
"The configuration is completed" = "Määritys on valmis";
"finish_setup_message" = "Kaikki on valmista! \n Stats on avoimen lähdekoodin työkalu, se on ilmainen ja tulee aina olemaan. \n Jos pidät siitä, voit tukea projektia, mikä on aina arvostettua!";

// Alerts
"New version available" = "Uusi versio saatavilla";
"Click to install the new version of Stats" = "Klikkaa asentaaksesi uuden version Statsista";
"Successfully updated" = "Päivitys onnistui";
"Stats was updated to v" = "Stats päivitettiin versioon v%0";
"Reset settings text" = "Kaikki sovelluksen asetukset nollataan, ja sovellus käynnistetään uudelleen. Haluatko varmasti tehdä tämän?";
"Support text" = "Kiitos, että käytät Statsia!\n\n Tämän avoimen lähdekoodin projektin ylläpitäminen ja parantaminen vie aikaa ja resursseja. Tukesi auttaa meitä jatkossakin tarjoamaan ilmaisen ja luotettavan sovelluksen kaikille.\n\nJos Stats on mielestäsi hyödyllinen, harkitse lahjoituksen tekemistä. Jokainen pieni osa auttaa!";

// Settings
"Open Activity Monitor" = "Avaa Aktiviteettimonitori";
"Report a bug" = "Ilmoita virheestä";
"Support the application" = "Tue sovellusta";
"Close application" = "Sulje sovellus";
"Open application settings" = "Avaa sovelluksen asetukset";
"Open dashboard" = "Avaa kojelauta";
"No notifications available in this module" = "Ei ilmoituksia tässä moduulissa";
"Open Calendar" = "Avaa kalenteri"; // translategemma:4b
"Toggle the module" = "Ota moduuli käyttöön/poista käytöstä"; // translategemma:4b

// Application settings
"Update application" = "Päivitä sovellus";
"Check for updates" = "Tarkista päivitykset";
"At start" = "Käynnistyksessä";
"Once per day" = "Kerran päivässä";
"Once per week" = "Kerran viikossa";
"Once per month" = "Kerran kuukaudessa";
"Never" = "Ei koskaan";
"Check for update" = "Tarkista päivitys";
"Show icon in dock" = "Näytä kuvake telakassa";
"Start at login" = "Käynnistä kirjautumisen yhteydessä";
"Build number" = "Kokoonpanon numero";
"Import settings" = "Tuo asetukset";
"Export settings" = "Vie asetukset";
"Reset settings" = "Nollaa asetukset";
"Pause the Stats" = "Keskeytä Stats";
"Resume the Stats" = "Jatka Statsin käyttöä";
"Combined modules" = "Yhdistetyt moduulit";
"Combined details" = "Yhdistetyt tiedot";
"Spacing" = "Rivien väli"; // translategemma:4b
"Share anonymous telemetry" = "Jaa anonyymi telemetria";
"Choose file" = "Valitse tiedosto"; // translategemma:4b
"Stress tests" = "Stressitestit"; // translategemma:4b

// Dashboard
"Serial number" = "Sarjanumero";
"Model identifier" = "Mallin tunniste";
"Production year" = "Valmistusvuosi";
"Uptime" = "Käyttöaika";
"Number of cores" = "%0 ydintä";
"Number of threads" = "%0 säiettä";
"Number of e-cores" = "%0 e-ydintä";
"Number of p-cores" = "%0 p-ydintä";
"Disks" = "Levyt"; // translategemma:4b
"Display" = "Näyttö"; // translategemma:4b

// Update
"The latest version of Stats installed" = "Stats on päivitetty viimeisimpään versioon";
"Downloading..." = "Ladataan...";
"Current version: " = "Nykyinen versio:  ";
"Latest version: " = "Viimeisin versio:    ";

// Widgets
"Color" = "Väri";
"Label" = "Tunniste";
"Box" = "Laatikko";
"Frame" = "Kehys";
"Value" = "Arvo";
"Colorize" = "Värjää";
"Colorize value" = "Värjää arvo";
"Additional information" = "Lisätiedot";
"Reverse values order" = "Käänteinen arvojärjestys";
"Base" = "Perusta";
"Display mode" = "Näyttötila";
"One row" = "Yksi rivi";
"Two rows" = "Kaksi riviä";
"Mini widget" = "Pieni"; // translategemma:4b
"Line chart widget" = "Viivakaavio";
"Bar chart widget" = "Pylväskaavio";
"Pie chart widget" = "Ympyräkaavio";
"Network chart widget" = "Verkkokaavio";
"Speed widget" = "Nopeus";
"Battery widget" = "Akku";
"Stack widget" = "Pino";
"Memory widget" = "Muisti";
"Static width" = "Staattinen leveys";
"Tachometer widget" = "Tachometri";
"State widget" = "Tila";
"Text widget" = "Tekstikomponentti"; // translategemma:4b
"Battery details widget" = "Akun tiedot -widget"; // translategemma:4b
"Show symbols" = "Näytä symbolit";
"Label widget" = "Tunniste";
"Number of reads in the chart" = "Lukukertojen määrä kaaviossa";
"Color of download" = "Latauksen väri";
"Color of upload" = "Lähetyksen väri";
"Monospaced font" = "Kiinteäleveyksinen fontti";
"Reverse order" = "Käänteinen järjestys";
"Chart history" = "Kaavion historia";
"Default color" = "Oletusväri";
"Transparent when no activity" = "Läpinäkyvä, kun ei ole toimintaa";
"Constant color" = "Vakio väri";

// Module Kit
"Open module settings" = "Avaa moduulin asetukset";
"Select widget" = "Valitse %0 widget";
"Open widget settings" = "Avaa widgetin asetukset";
"Update interval" = "Päivitysväli";
"Usage history" = "Käytön historia";
"Details" = "Tiedot";
"Top processes" = "Suosituimmat prosessit";
"Pictogram" = "Piktogrammi";
"Module" = "Moduuli";
"Widgets" = "Widgetit";
"Popup" = "Ponnahdusikkuna";
"Notifications" = "Ilmoitukset";
"Merge widgets" = "Yhdistä widgetit";
"No available widgets to configure" = "Ei muokattavia widgettejä";
"No options to configure for the popup in this module" = "Ei muokattavia asetuksia tälle moduulille";
"Process" = "Prosessi";
"Kill process" = "Lopeta prosessi";
"Keyboard shortcut" = "Näppäimistön yhdistelmä"; // translategemma:4b
"Listening..." = "Kuuntelen…"; // translategemma:4b

// Modules
"Number of top processes" = "Suosittujen prosessien määrä";
"Update interval for top processes" = "Suosittujen prosessien päivitysväli";
"Notification level" = "Ilmoitustaso";
"Chart color" = "Kaavion väri";
"Main chart scaling" = "Pääkaavion skaalaus";
"Scale value" = "Skaalausarvo";
"Text widget value" = "Tekstikomponentin arvo"; // translategemma:4b

// CPU
"CPU usage" = "Suorittimen käyttö";
"CPU temperature" = "Suorittimen lämpötila";
"CPU frequency" = "Suorittimen taajuus";
"System" = "Järjestelmä";
"User" = "Käyttäjä";
"Idle" = "Lepotila";
"Show usage per core" = "Näytä käyttö ytimittäin";
"Show hyper-threading cores" = "Näytä hyper-threading-ytimet";
"Split the value (System/User)" = "Jaa arvo (Järjestelmä/Käyttäjä)";
"Scheduler limit" = "Ajastimen raja";
"Speed limit" = "Nopeusraja";
"Average load" = "Keskimääräinen kuorma";
"1 minute" = "1 minuutti";
"5 minutes" = "5 minuuttia";
"15 minutes" = "15 minuuttia";
"CPU usage threshold" = "Suorittimen käytön raja";
"CPU usage is" = "Suorittimen käyttö on %0";
"Efficiency cores" = "Tehokkuusytimet";
"Performance cores" = "Suorituskykyytimet";
"System color" = "Järjestelmän väri";
"User color" = "Käyttäjän väri";
"Idle color" = "Lepotilan väri";
"Cluster grouping" = "Ryhmien klusterointi";
"Efficiency cores color" = "E-ytimien väri";
"Performance cores color" = "P-ytimien väri";
"Total load" = "Kokonaiskuorma";
"System load" = "Järjestelmäkuorma";
"User load" = "Käyttäjäkuorma";
"Efficiency cores load" = "Tehokkuusytimien kuorma";
"Performance cores load" = "Suorituskykyytimien kuorma";
"All cores" = "Kaikki ytimet"; // translategemma:4b

// GPU
"GPU to show" = "Näytettävä GPU";
"Show GPU type" = "Näytä GPU-tyyppi";
"GPU enabled" = "GPU käytössä";
"GPU disabled" = "GPU pois käytöstä";
"GPU temperature" = "GPU:n lämpötila";
"GPU utilization" = "GPU:n käyttö";
"Vendor" = "Valmistaja";
"Model" = "Malli";
"Status" = "Tila";
"Active" = "Aktiivinen";
"Non active" = "Ei aktiivinen";
"Fan speed" = "Tuuletinnopeus";
"Core clock" = "Ytimen kellotaajuus";
"Memory clock" = "Muistin kellotaajuus";
"Utilization" = "Käyttöaste";
"Render utilization" = "Renderöinnin käyttöaste";
"Tiler utilization" = "Tilerin käyttöaste";
"GPU usage threshold" = "GPU:n käytön raja";
"GPU usage is" = "GPU:n käyttö on %0";

// RAM
"Memory usage" = "Muistin käyttö";
"Memory pressure" = "Muistipaine";
"Total" = "Kokonaismäärä";
"Used" = "Käytetty";
"App" = "Sovellus";
"Wired" = "Johdettu";
"Compressed" = "Pakatut";
"Free" = "Vapaa";
"Swap" = "Välimuisti";
"Split the value (App/Wired/Compressed)" = "Jaa arvo (Sovellus/Johdettu/Pakatut)";
"RAM utilization threshold" = "RAMin käytön raja";
"RAM utilization is" = "RAMin käyttö on %0";
"App color" = "Sovelluksen väri";
"Wired color" = "Johdettujen väri";
"Compressed color" = "Pakattujen väri";
"Free color" = "Vapaan väri";
"Free memory (less than)" = "Vapaa muisti (alle)";
"Swap size" = "Välimuistin koko";
"Free RAM is" = "Vapaa RAM on %0";

// Disk
"Show removable disks" = "Näytä irrotettavat levyt";
"Used disk memory" = "%0 / %1 käytössä";
"Free disk memory" = "%0 / %1 vapaana";
"Disk to show" = "Näytettävä levy";
"Open disk" = "Avaa levy";
"Switch view" = "Vaihda näkymää";
"Disk utilization threshold" = "Levyn käytön raja";
"Disk utilization is" = "Levyn käyttö on %0";
"Read color" = "Luvun väri";
"Write color" = "Kirjoituksen väri";
"Disk usage" = "Levyn käyttö";
"Total read" = "Luettu yhteensä";
"Total written" = "Kirjoitettu yhteensä";
"Write speed" = "Kirjoitusnopeus";
"Read speed" = "Lukunopeus";
"Drives" = "Voimansiirrot"; // translategemma:4b
"SMART data" = "SMART-data"; // translategemma:4b

// Sensors
"Temperature unit" = "Lämpötilan yksikkö";
"Celsius" = "Celsius";
"Fahrenheit" = "Fahrenheit";
"Save the fan speed" = "Tallenna tuulettimen nopeus";
"Fan" = "Tuuletin";
"HID sensors" = "HID-anturit";
"Synchronize fan's control" = "Synkronoi tuulettimen hallinta";
"Current" = "Virta";
"Energy" = "Energia";
"Show unknown sensors" = "Näytä tuntemattomat anturit";
"Install fan helper" = "Asenna tuuletinavustaja";
"Uninstall fan helper" = "Poista tuuletinavustaja";
"Fan value" = "Tuulettimen arvo";
"Turn off fan" = "Sammuta tuuletin";
"You are going to turn off the fan. This is not recommended action that can damage your mac, are you sure you want to do that?" = "Olet sammuttamassa tuuletinta. Tämä ei ole suositeltavaa ja voi vahingoittaa Maciasi. Haluatko varmasti tehdä tämän?";
"Sensor threshold" = "Anturin raja";
"Left fan" = "Vasen tuuletin";
"Right fan" = "Oikea tuuletin";
"Fastest fan" = "Nopein tuuletin";
"Sensor to show" = "Anturi, joka näyttää"; // translategemma:4b

// Network
"Uploading" = "Lähetys";
"Downloading" = "Lataus";
"Public IP" = "Julkinen IP";
"Local IP" = "Paikallinen IP";
"Interface" = "Liitäntä";
"Physical address" = "Fyysinen osoite";
"Refresh" = "Päivitä";
"Click to copy public IP address" = "Kopioi julkinen IP-osoite napsauttamalla";
"Click to copy local IP address" = "Kopioi paikallinen IP-osoite napsauttamalla";
"Click to copy wifi name" = "Kopioi Wi-Fi-nimi napsauttamalla";
"Click to copy mac address" = "Kopioi MAC-osoite napsauttamalla";
"No connection" = "Ei yhteyttä";
"Network interface" = "Verkkoliitäntä";
"Total download" = "Ladattu yhteensä";
"Total upload" = "Lähetetty yhteensä";
"Reader type" = "Lukijan tyyppi";
"Interface based" = "Liitäntäpohjainen";
"Processes based" = "Prosessipohjainen";
"Reset data usage" = "Nollaa tiedonsiirto";
"VPN mode" = "VPN-tila";
"Standard" = "Standardi";
"Security" = "Turvallisuus";
"Channel" = "Kanava";
"Common scale" = "Yleinen skaala";
"Autodetection" = "Automaattinen tunnistus";
"Widget activation threshold" = "Widgetin aktivoinnin raja";
"Internet connection" = "Internet-yhteys";
"Active state color" = "Aktiivitilan väri";
"Nonactive state color" = "Ei-aktiivitilan väri";
"Connectivity host (ICMP)" = "Yhteyden isäntä (ICMP)";
"Leave empty to disable the check" = "Jätä tyhjäksi poistaaksesi tarkistuksen käytöstä";
"Connectivity history" = "Yhteyshistoria";
"Auto-refresh public IP address" = "Päivitä julkinen IP-osoite automaattisesti";
"Every hour" = "Joka tunti";
"Every 12 hours" = "Joka 12. tunti";
"Every 24 hours" = "Joka 24. tunti";
"Network activity" = "Verkkoaktiivisuus";
"Last reset" = "Viimeksi nollattu %0 sitten";
"Latency" = "Viive";
"Upload speed" = "Lähetysnopeus";
"Download speed" = "Latausnopeus";
"Address" = "Osoite"; // translategemma:4b
"WiFi network" = "Wi-Fi-verkko"; // translategemma:4b
"Local IP changed" = "Paikallinen IP-osoite on muuttunut"; // translategemma:4b
"Public IP changed" = "Julkinen IP-osoite on muuttunut"; // translategemma:4b
"Previous IP" = "Edellinen IP-osoite: %0"; // translategemma:4b
"New IP" = "Uusi IP-osoite: %0"; // translategemma:4b
"Internet connection lost" = "Internet-yhteys katkennut"; // translategemma:4b
"Internet connection established" = "Internet-yhteys muodostettu"; // translategemma:4b

// Battery
"Level" = "Taso";
"Source" = "Lähde";
"AC Power" = "Verkkovirta";
"Battery Power" = "Akkuvirta";
"Time" = "Aika";
"Health" = "Kunto";
"Amperage" = "Ampeerimäärä";
"Voltage" = "Jännite";
"Cycles" = "Sykliä";
"Temperature" = "Lämpötila";
"Power adapter" = "Virtalähde";
"Power" = "Teho";
"Is charging" = "Lataa";
"Time to discharge" = "Purkamisaika";
"Time to charge" = "Latausaika";
"Calculating" = "Lasketaan";
"Fully charged" = "Täyteen ladattu";
"Not connected" = "Ei kytketty";
"Low level notification" = "Matala tason ilmoitus";
"High level notification" = "Korkea tason ilmoitus";
"Low battery" = "Akku Vähissä";
"High battery" = "Akun varaus korkea";
"Battery remaining" = "%0% jäljellä";
"Battery remaining to full charge" = "%0% täyteen lataukseen";
"Percentage" = "Prosentti";
"Percentage and time" = "Prosentti ja aika";
"Time and percentage" = "Aika ja prosentti";
"Time format" = "Ajan muoto";
"Hide additional information when full" = "Piilota lisätiedot, kun täynnä";
"Last charge" = "Viimeinen lataus";
"Capacity" = "Kapasiteetti";
"current / maximum / designed" = "nykyinen / maksimi / suunniteltu";
"Low power mode" = "Virransäästötila";
"Percentage inside the icon" = "Prosentti kuvakkeen sisällä";
"Colorize battery" = "Värjää akku";
"Charging current" = "Latausvirta";
"Charging Voltage" = "Latausjännite";
"Charger state inside the battery" = "Latauksen tila akun sisällä"; // translategemma:4b

// Bluetooth
"Battery to show" = "Näytettävä akku";
"No Bluetooth devices are available" = "Bluetooth-laitteita ei ole saatavilla";

// Clock
"Time zone" = "Aikavyöhyke";
"Local" = "Paikallinen";
"Calendar" = "Kalenteri";
"Show week numbers" = "Näytä viikonumerot"; // translategemma:4b
"Local time" = "Paikallinen aika";
"Add new clock" = "Lisää uusi kello"; // translategemma:4b
"Delete selected clock" = "Poista valittu kellonaika"; // translategemma:4b
"Help with datetime format" = "Apua päivämäärän ja ajan muotoilussa"; // translategemma:4b

// Colors
"Based on utilization" = "Perustuu käyttöasteeseen";
"Based on pressure" = "Perustuu paineeseen";
"Based on cluster" = "Perustuu klusteriin";
"System accent" = "Järjestelmän korostus";
"Monochrome accent" = "Yksivärinen korostus";
"Clear" = "Kirkas";
"White" = "Valkoinen";
"Black" = "Musta";
"Gray" = "Harmaa";
"Second gray" = "Toinen harmaa";
"Dark gray" = "Tumma harmaa";
"Light gray" = "Vaalea harmaa";
"Red" = "Punainen";
"Second red" = "Toinen punainen";
"Green" = "Vihreä";
"Second green" = "Toinen vihreä";
"Blue" = "Sininen";
"Second blue" = "Toinen sininen";
"Yellow" = "Keltainen";
"Second yellow" = "Toinen keltainen";
"Orange" = "Oranssi";
"Second orange" = "Toinen oranssi";
"Purple" = "Violetti";
"Second purple" = "Toinen violetti";
"Brown" = "Ruskea";
"Second brown" = "Toinen ruskea";
"Cyan" = "Syaani";
"Magenta" = "Magenta";
"Pink" = "Vaaleanpunainen";
"Teal" = "Sinivihreä";
"Indigo" = "Indigo";
